#ifndef THREAD_TABLES_H
#define THREAD_TABLES_H

#include <stdint.h>

/* ============================================================
ТАБЛИЦЫ РЕЗЬБ ПО ГОСТ (метрические)
============================================================ */

typedef struct {
float pitch_mm;
float depth_mm;
uint8_t passes;
} ThreadParameter_t;

// Метрические резьбы ГОСТ 8724-2002
static const ThreadParameter_t metric_threads[] = {
{0.25, 0.15, 3},
{0.30, 0.18, 3},
{0.35, 0.21, 4},
{0.40, 0.24, 4},
{0.45, 0.27, 4},
{0.50, 0.30, 5},
{0.60, 0.36, 5},
{0.70, 0.42, 6},
{0.75, 0.45, 6},
{0.80, 0.48, 6},
{1.00, 0.60, 7},
{1.25, 0.75, 8},
{1.50, 0.90, 9},
{1.75, 1.05, 10},
{2.00, 1.20, 10},
{2.50, 1.50, 12},
{3.00, 1.80, 14},
{3.50, 2.10, 15},
{4.00, 2.40, 16},
{4.50, 2.70, 17},
{5.00, 3.00, 18},
{5.50, 3.30, 19},
{6.00, 3.60, 20}
};


#define METRIC_THREADS_COUNT \
    (sizeof(metric_threads) / sizeof(ThreadParameter_t))

#endif
